Revit 2027 API
AreaBasedLoadBoundaryLineData.IsLevelWithinRange Method
 Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLevelWithinRange(
	ElementId levelId
)
Public Function IsLevelWithinRange (
	levelId As ElementId
) As Boolean
public:
bool IsLevelWithinRange(
	ElementId^ levelId
)
member IsLevelWithinRange :
        levelId : ElementId -> bool
Parameters
levelId ElementId
 The id of the Level.
Return Value
Boolean
 True if given level is between the bottom level and the top level, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The ElementId levelId is not a Level.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace